{"class_name": "Tokenizer", "config": {"num_words": 10000, "filters": "!\"#$%&()*+,-./:;<=>?@[\\]^_`{|}~\t\n", "lower": true, "split": " ", "char_level": false, "oov_token": "<OOV>", "document_count": 19940, "word_counts": "{\"post\": 274, \"also\": 1380, \"available\": 294, \"japanese\": 100, \"ctblocker\": 4, \"wellknown\": 26, \"ransomware\": 720, \"trojan\": 131, \"used\": 1417, \"crimeware\": 7, \"group\": 1107, \"encrypt\": 42, \"file\": 1892, \"victim\": 575, \"endpoint\": 218, \"demand\": 34, \"ransom\": 190, \"payment\": 98, \"decrypt\": 66, \"back\": 133, \"original\": 129, \"state\": 77, \"antiviruses\": 2, \"detect\": 145, \"mistake\": 14, \"cryptolocker\": 6, \"one\": 825, \"vendor\": 211, \"correctly\": 20, \"detects\": 24, \"attack\": 2162, \"vector\": 112, \"basic\": 51, \"repeat\": 4, \"begin\": 86, \"spear\": 129, \"phishing\": 1029, \"email\": 1075, \"sent\": 291, \"scr\": 2, \"attachment\": 136, \"double\": 21, \"zipped\": 2, \"executed\": 130, \"user\": 1433, \"first\": 493, \"stage\": 190, \"malware\": 1667, \"downloads\": 141, \"executes\": 102, \"fixed\": 15, \"hardcoded\": 93, \"server\": 1015, \"list\": 233, \"known\": 312, \"campaign\": 1016, \"wa\": 1248, \"launched\": 51, \"november\": 54, \"downloaded\": 152, \"site\": 325, \"serious\": 54, \"january\": 70, \"palo\": 316, \"alto\": 316, \"network\": 915, \"enterprise\": 104, \"security\": 1200, \"platform\": 238, \"ha\": 1171, \"discovered\": 197, \"unique\": 123, \"since\": 344, \"attacker\": 1034, \"polymorphic\": 4, \"builder\": 8, \"generate\": 63, \"hash\": 116, \"preventing\": 36, \"signaturebased\": 4, \"solution\": 212, \"detecting\": 40, \"new\": 675, \"late\": 48, \"tactic\": 183, \"nightmare\": 2, \"legacy\": 18, \"product\": 275, \"based\": 272, \"technique\": 526, \"byte\": 132, \"signature\": 149, \"damage\": 22, \"done\": 77, \"instead\": 123, \"true\": 32, \"offer\": 72, \"multilayer\": 2, \"protection\": 384, \"prevent\": 138, \"along\": 25, \"without\": 129, \"need\": 195, \"prior\": 39, \"knowledge\": 76, \"specific\": 187, \"see\": 245, \"hostnames\": 6, \"changed\": 62, \"didnt\": 26, \"change\": 120, \"ip\": 326, \"address\": 522, \"attached\": 44, \"result\": 184, \"last\": 243, \"week\": 79, \"virustotal\": 51, \"program\": 228, \"could\": 272, \"time\": 448, \"posted\": 46, \"retest\": 2, \"average\": 26, \"engine\": 46, \"threat\": 1610, \"thats\": 48, \"little\": 44, \"anyone\": 44, \"already\": 132, \"lost\": 14, \"data\": 776, \"started\": 60, \"earlier\": 84, \"today\": 101, \"us\": 354, \"even\": 207, \"iocs\": 165, \"added\": 115, \"two\": 444, \"shouldnt\": 6, \"surprised\": 4, \"malicious\": 867, \"found\": 545, \"piece\": 56, \"alone\": 10, \"fully\": 46, \"undetectable\": 6, \"barely\": 4, \"detected\": 213, \"detection\": 295, \"rate\": 12, \"basically\": 12, \"choice\": 15, \"surprising\": 12, \"fact\": 69, \"almost\": 42, \"havent\": 32, \"still\": 182, \"using\": 884, \"weve\": 209, \"sha\": 103, \"text\": 115, \"format\": 66, \"reference\": 49, \"show\": 343, \"continues\": 102, \"progress\": 12, \"exhaustive\": 4, \"close\": 31, \"would\": 283, \"stopped\": 14, \"thanks\": 6, \"integration\": 8, \"cloud\": 373, \"maximize\": 6, \"arent\": 18, \"getting\": 28, \"le\": 88, \"sophisticated\": 74, \"leave\": 22, \"behind\": 124, \"upgrade\": 24, \"real\": 54, \"preventionbased\": 2, \"sign\": 181, \"receive\": 221, \"latest\": 347, \"news\": 344, \"cyber\": 367, \"intelligence\": 267, \"research\": 549, \"u\": 537, \"please\": 328, \"enter\": 170, \"mark\": 151, \"im\": 182, \"robot\": 152, \"submitting\": 148, \"form\": 219, \"agree\": 148, \"term\": 193, \"use\": 911, \"acknowledge\": 148, \"privacy\": 180, \"statement\": 153, \"past\": 144, \"six\": 24, \"month\": 115, \"seen\": 285, \"major\": 46, \"increase\": 65, \"number\": 335, \"ultimate\": 12, \"goal\": 46, \"mining\": 98, \"cryptocurrency\": 94, \"subject\": 40, \"unit\": 223, \"tracking\": 101, \"year\": 294, \"driving\": 16, \"widespread\": 16, \"shift\": 28, \"creating\": 44, \"significant\": 80, \"trend\": 413, \"industry\": 164, \"three\": 187, \"factor\": 26, \"work\": 222, \"answer\": 17, \"question\": 30, \"detail\": 208, \"important\": 154, \"put\": 50, \"criminal\": 75, \"shoe\": 4, \"consider\": 44, \"alternative\": 12, \"route\": 8, \"monetize\": 8, \"infection\": 223, \"brief\": 56, \"well\": 329, \"share\": 200, \"came\": 34, \"fruition\": 2, \"prevalent\": 9, \"professional\": 23, \"defender\": 82, \"keep\": 76, \"eye\": 8, \"rising\": 14, \"type\": 195, \"targeted\": 485, \"gain\": 88, \"attention\": 34, \"researcher\": 213, \"medium\": 79, \"majority\": 56, \"untargeted\": 2, \"indiscriminate\": 2, \"seeking\": 16, \"target\": 708, \"many\": 313, \"aim\": 27, \"infect\": 22, \"system\": 950, \"possible\": 155, \"turn\": 32, \"cash\": 6, \"decade\": 28, \"although\": 98, \"mechanism\": 114, \"shifted\": 12, \"understand\": 99, \"help\": 256, \"look\": 154, \"got\": 32, \"evolution\": 28, \"common\": 122, \"cybercriminal\": 22, \"activity\": 510, \"early\": 92, \"earliest\": 16, \"botnet\": 77, \"herder\": 4, \"made\": 87, \"income\": 10, \"relaying\": 4, \"spam\": 94, \"infected\": 159, \"computer\": 90, \"business\": 145, \"became\": 13, \"profitable\": 8, \"due\": 99, \"antispam\": 2, \"control\": 303, \"isps\": 10, \"directly\": 129, \"mids\": 2, \"great\": 42, \"profit\": 26, \"banking\": 84, \"steal\": 138, \"credential\": 505, \"online\": 168, \"website\": 526, \"subsequently\": 26, \"draining\": 2, \"account\": 763, \"associated\": 148, \"fund\": 14, \"takeover\": 8, \"various\": 150, \"antifraud\": 4, \"measure\": 36, \"law\": 36, \"enforcement\": 24, \"action\": 197, \"riskier\": 2, \"another\": 251, \"aspect\": 14, \"may\": 439, \"infecting\": 18, \"host\": 184, \"indiscriminately\": 2, \"value\": 199, \"greatly\": 6, \"depends\": 24, \"individual\": 95, \"owns\": 4, \"ability\": 94, \"bank\": 20, \"figure\": 1644, \"capture\": 69, \"book\": 2, \"wrote\": 17, \"colleague\": 6, \"fraud\": 16, \"procedure\": 64, \"price\": 36, \"called\": 131, \"iframe\": 10, \"dollar\": 24, \"charging\": 6, \"country\": 168, \"showing\": 95, \"australia\": 6, \"went\": 9, \"poland\": 6, \"fraction\": 6, \"cost\": 16, \"difference\": 52, \"represented\": 8, \"able\": 187, \"make\": 298, \"money\": 45, \"australian\": 6, \"evolved\": 10, \"fast\": 28, \"forward\": 30, \"five\": 84, \"rise\": 26, \"model\": 43, \"way\": 235, \"advantage\": 47, \"increased\": 24, \"efficiency\": 8, \"decreased\": 16, \"risk\": 253, \"monetizing\": 2, \"paying\": 24, \"cybercrime\": 62, \"aware\": 53, \"surge\": 10, \"throughout\": 34, \"world\": 109, \"plaguing\": 2, \"administrator\": 82, \"tiny\": 4, \"possibly\": 46, \"pay\": 65, \"much\": 75, \"higher\": 36, \"portion\": 14, \"get\": 350, \"single\": 80, \"return\": 46, \"greater\": 32, \"volume\": 34, \"cybercriminals\": 62, \"become\": 63, \"good\": 89, \"people\": 82, \"saw\": 74, \"benefit\": 30, \"embraced\": 4, \"bubble\": 2, \"particularly\": 53, \"bitcoin\": 64, \"cryptocurrencies\": 30, \"experienced\": 14, \"massive\": 4, \"respect\": 2, \"fiat\": 2, \"currency\": 24, \"chart\": 10, \"versus\": 4, \"coinmarketcap\": 4, \"botnets\": 12, \"nothing\": 22, \"specialized\": 24, \"hardware\": 32, \"regular\": 30, \"pc\": 42, \"amount\": 54, \"however\": 302, \"crypto\": 6, \"coin\": 76, \"market\": 40, \"mined\": 4, \"monero\": 36, \"contrast\": 14, \"designed\": 109, \"enable\": 90, \"private\": 122, \"transaction\": 22, \"closed\": 2, \"ledger\": 2, \"algorithm\": 87, \"effectively\": 44, \"cpu\": 14, \"gpus\": 4, \"risen\": 2, \"faster\": 10, \"normal\": 54, \"mine\": 30, \"earn\": 10, \"around\": 175, \"per\": 50, \"day\": 234, \"current\": 99, \"small\": 48, \"note\": 213, \"doesnt\": 43, \"matter\": 28, \"miner\": 26, \"part\": 419, \"speed\": 15, \"every\": 94, \"profitgenerating\": 2, \"resource\": 177, \"likely\": 205, \"identify\": 169, \"remove\": 42, \"context\": 46, \"million\": 54, \"largely\": 16, \"developing\": 40, \"remained\": 48, \"least\": 111, \"hour\": 52, \"earned\": 4, \"additionally\": 102, \"arrest\": 6, \"conviction\": 2, \"significantly\": 14, \"lower\": 12, \"report\": 336, \"datadestroying\": 2, \"whats\": 6, \"next\": 92, \"wave\": 25, \"continue\": 171, \"long\": 42, \"maintains\": 12, \"high\": 107, \"level\": 93, \"profitability\": 6, \"low\": 12, \"typically\": 96, \"carrying\": 19, \"macro\": 136, \"document\": 474, \"driveby\": 22, \"exploit\": 712, \"kit\": 91, \"targeting\": 364, \"browser\": 221, \"direct\": 24, \"running\": 222, \"vulnerable\": 167, \"software\": 342, \"stopping\": 12, \"technology\": 112, \"policy\": 72, \"effective\": 81, \"across\": 251, \"changing\": 44, \"landscape\": 29, \"constant\": 18, \"businesssavvy\": 2, \"drive\": 104, \"reduce\": 10, \"guide\": 2, \"sense\": 26, \"prepared\": 8, \"yet\": 40, \"develop\": 39, \"future\": 60, \"thing\": 101, \"watch\": 12, \"marked\": 12, \"draw\": 16, \"actually\": 48, \"positive\": 10, \"development\": 103, \"negative\": 6, \"impact\": 90, \"sapped\": 2, \"restoring\": 2, \"backup\": 48, \"conversely\": 2, \"crash\": 10, \"decrease\": 12, \"listen\": 10, \"fan\": 8, \"usage\": 40, \"realize\": 6, \"laptop\": 4, \"kick\": 4, \"highspeed\": 2, \"mode\": 26, \"overtaxed\": 2, \"cool\": 4, \"listening\": 4, \"wont\": 22, \"scale\": 22, \"implementing\": 16, \"performance\": 14, \"monitoring\": 99, \"find\": 133, \"compromised\": 381, \"device\": 529, \"insider\": 12, \"misguided\": 2, \"organization\": 592, \"unused\": 6, \"personal\": 46, \"compromising\": 40, \"home\": 78, \"net\": 70, \"higherend\": 2, \"soon\": 35, \"specification\": 10, \"bang\": 2, \"buck\": 2, \"gaming\": 14, \"highend\": 2, \"large\": 60, \"processing\": 6, \"core\": 69, \"prime\": 10, \"analyzed\": 102, \"reviewed\": 10, \"occurred\": 20, \"half\": 38, \"angle\": 2, \"midyear\": 2, \"roundup\": 6, \"highlight\": 24, \"active\": 201, \"apts\": 26, \"zeroday\": 70, \"id\": 153, \"like\": 525, \"area\": 58, \"seeing\": 40, \"infrastructure\": 219, \"ive\": 4, \"spoken\": 2, \"event\": 148, \"asked\": 13, \"audience\": 12, \"project\": 94, \"going\": 68, \"always\": 100, \"h\": 6, \"index\": 6, \"top\": 101, \"obviously\": 10, \"moving\": 18, \"quickly\": 87, \"thinking\": 10, \"secure\": 95, \"overview\": 42, \"impacting\": 20, \"environment\": 169, \"apt\": 432, \"named\": 193, \"teamtnt\": 4, \"quite\": 34, \"focused\": 56, \"effort\": 110, \"planting\": 2, \"cryptomining\": 2, \"utilize\": 32, \"ddos\": 68, \"irc\": 12, \"bot\": 39, \"exfil\": 4, \"diagram\": 13, \"end\": 101, \"speaking\": 6, \"actor\": 894, \"cloudbased\": 20, \"storage\": 98, \"exfiltrate\": 22, \"stolen\": 127, \"example\": 339, \"conti\": 48, \"operator\": 99, \"synchronization\": 3, \"tool\": 691, \"rclone\": 11, \"upload\": 102, \"mega\": 10, \"service\": 599, \"similarly\": 15, \"darkside\": 77, \"client\": 127, \"exfiltrating\": 20, \"zip\": 55, \"archiving\": 5, \"putty\": 5, \"application\": 457, \"transfer\": 31, \"legitimate\": 357, \"call\": 106, \"living\": 12, \"land\": 4, \"pick\": 2, \"recently\": 215, \"including\": 255, \"within\": 230, \"architecture\": 36, \"strategy\": 56, \"mind\": 10, \"case\": 294, \"motivation\": 12, \"image\": 91, \"fall\": 16, \"depending\": 40, \"backwards\": 4, \"protecting\": 49, \"initial\": 178, \"access\": 438, \"tied\": 6, \"different\": 419, \"challenge\": 38, \"face\": 28, \"isnt\": 46, \"simple\": 93, \"feature\": 198, \"deployed\": 93, \"understanding\": 50, \"importantly\": 8, \"difficult\": 70, \"utilizing\": 14, \"approach\": 64, \"build\": 81, \"educating\": 2, \"architect\": 2, \"key\": 453, \"hardening\": 6, \"regularly\": 33, \"multifactor\": 20, \"authentication\": 109, \"minimize\": 10, \"tremendously\": 2, \"take\": 277, \"micro\": 332, \"complete\": 56, \"cybersecurity\": 96, \"learn\": 30, \"full\": 113, \"observed\": 562, \"download\": 378, \"read\": 106, \"tag\": 460, \"crime\": 36, \"expert\": 64, \"perspective\": 24, \"article\": 110, \"anonymous\": 6, \"nature\": 36, \"preferred\": 15, \"method\": 175, \"released\": 175, \"hijacking\": 61, \"web\": 298, \"compute\": 12, \"exchange\": 121, \"increasing\": 18, \"ethereum\": 4, \"better\": 64, \"exploittype\": 2, \"surprise\": 6, \"becoming\": 8, \"commonplace\": 4, \"compromise\": 233, \"abuse\": 81, \"visitor\": 60, \"essentially\": 8, \"credit\": 48, \"occurs\": 20, \"consent\": 22, \"duration\": 8, \"visit\": 24, \"cause\": 32, \"longterm\": 20, \"provide\": 150, \"intended\": 34, \"functionality\": 97, \"experience\": 24, \"noticeable\": 6, \"slowdown\": 6, \"believe\": 141, \"affected\": 109, \"leaving\": 6, \"closing\": 6, \"practice\": 86, \"hygiene\": 10, \"mean\": 125, \"avoiding\": 4, \"unfamiliar\": 6, \"clicking\": 36, \"link\": 360, \"downloading\": 84, \"unknown\": 64, \"sender\": 34, \"keeping\": 22, \"updated\": 240, \"patch\": 191, \"enabling\": 33, \"reputable\": 4, \"unlocking\": 2, \"lucrative\": 14, \"bryan\": 2, \"lee\": 2, \"thought\": 38, \"hundred\": 24, \"variant\": 284, \"wild\": 82, \"total\": 54, \"reasonable\": 12, \"ask\": 32, \"exist\": 20, \"thrive\": 2, \"outlined\": 21, \"addition\": 117, \"human\": 38, \"technical\": 148, \"reason\": 60, \"specifically\": 76, \"combine\": 10, \"potent\": 8, \"point\": 125, \"obvious\": 20, \"ramification\": 2, \"hard\": 31, \"stop\": 96, \"discussed\": 62, \"documented\": 31, \"let\": 45, \"recap\": 4, \"varies\": 6, \"unpatched\": 36, \"vulnerability\": 1126, \"social\": 122, \"engineering\": 103, \"levy\": 2, \"browsing\": 120, \"overwhelming\": 6, \"microsoft\": 466, \"window\": 394, \"seek\": 10, \"encrypts\": 31, \"folder\": 89, \"hold\": 23, \"information\": 790, \"critical\": 189, \"database\": 52, \"enough\": 36, \"executing\": 50, \"privilege\": 117, \"nowcompromised\": 2, \"fair\": 6, \"game\": 82, \"heart\": 4, \"operating\": 127, \"view\": 68, \"though\": 28, \"robust\": 29, \"inherent\": 2, \"limitation\": 4, \"vista\": 2, \"enabled\": 42, \"aggressive\": 6, \"checking\": 34, \"ensure\": 110, \"userinitiated\": 2, \"wellintentioned\": 2, \"ultimately\": 14, \"backfired\": 2, \"fed\": 2, \"sure\": 42, \"dialog\": 14, \"box\": 34, \"disabled\": 6, \"mindlessly\": 2, \"clicked\": 28, \"ok\": 20, \"adjustment\": 4, \"alert\": 78, \"raised\": 6, \"sparingly\": 4, \"never\": 34, \"protect\": 303, \"clear\": 51, \"lesson\": 6, \"check\": 142, \"fails\": 6, \"bringing\": 18, \"bear\": 22, \"raise\": 26, \"everyday\": 4, \"operation\": 607, \"kind\": 100, \"second\": 194, \"come\": 120, \"unlike\": 45, \"go\": 70, \"care\": 20, \"happen\": 23, \"daytoday\": 12, \"basis\": 2, \"extra\": 24, \"layer\": 74, \"incredibly\": 2, \"onerous\": 2, \"imagine\": 4, \"click\": 51, \"picture\": 37, \"opened\": 28, \"sole\": 4, \"chance\": 35, \"ransomwares\": 6, \"success\": 26, \"brings\": 6, \"third\": 79, \"wasted\": 2, \"dont\": 106, \"successful\": 129, \"halted\": 2, \"achieve\": 10, \"userdll\": 2, \"encrypted\": 231, \"unusable\": 8, \"problem\": 58, \"overall\": 26, \"accounting\": 2, \"audit\": 6, \"inaccessible\": 6, \"right\": 111, \"big\": 24, \"deadline\": 2, \"catastrophic\": 6, \"focus\": 80, \"placed\": 14, \"solely\": 10, \"prevention\": 112, \"cant\": 27, \"succeed\": 9, \"count\": 18, \"scope\": 32, \"broad\": 22, \"deep\": 40, \"assessment\": 40, \"class\": 66, \"acknowledges\": 2, \"several\": 211, \"russiaukraine\": 10, \"escalated\": 2, \"substantially\": 7, \"beginning\": 24, \"feb\": 42, \"series\": 51, \"distributed\": 59, \"denial\": 22, \"commenced\": 2, \"continued\": 35, \"ukrainian\": 74, \"government\": 272, \"institution\": 38, \"wiper\": 17, \"hermeticwiper\": 11, \"ukraine\": 165, \"shortly\": 20, \"round\": 22, \"defacement\": 14, \"consistent\": 38, \"previous\": 178, \"reporting\": 39, \"topic\": 26, \"western\": 8, \"issued\": 34, \"recommendation\": 66, \"population\": 4, \"prepare\": 14, \"cyberattacks\": 32, \"disrupt\": 38, \"disable\": 40, \"destroy\": 4, \"russian\": 120, \"reported\": 116, \"published\": 94, \"recent\": 184, \"gamaredon\": 20, \"european\": 25, \"retaliation\": 2, \"sanction\": 10, \"political\": 56, \"recommend\": 53, \"proactively\": 18, \"defend\": 50, \"potential\": 107, \"add\": 82, \"update\": 319, \"additional\": 230, \"customer\": 252, \"march\": 122, \"scam\": 51, \"cybersquatting\": 21, \"fake\": 249, \"donation\": 16, \"distribution\": 62, \"binary\": 237, \"visualization\": 4, \"relevant\": 47, \"course\": 52, \"indicator\": 241, \"related\": 312, \"atom\": 4, \"viewer\": 4, \"apps\": 359, \"working\": 92, \"safe\": 156, \"cyberthreats\": 2, \"consulting\": 8, \"appendix\": 24, \"cortex\": 111, \"xpanse\": 30, \"identifying\": 48, \"asset\": 44, \"impacted\": 28, \"cisas\": 4, \"exploited\": 109, \"cyberpolice\": 2, \"resident\": 4, \"actively\": 82, \"receiving\": 30, \"sm\": 164, \"message\": 300, \"alarm\": 2, \"among\": 65, \"claimed\": 27, \"atm\": 4, \"malfunctioning\": 2, \"ministry\": 31, \"defense\": 129, \"foreign\": 36, \"affair\": 20, \"armed\": 8, \"force\": 42, \"publicly\": 104, \"funded\": 2, \"broadcaster\": 5, \"radio\": 2, \"privatbank\": 2, \"oschadbank\": 2, \"investigation\": 458, \"suggested\": 12, \"mirai\": 15, \"meris\": 2, \"leveraged\": 35, \"united\": 43, \"kingdom\": 6, \"attributed\": 88, \"russia\": 122, \"main\": 142, \"directorate\": 6, \"gru\": 15, \"observe\": 23, \"relatively\": 24, \"flow\": 40, \"financial\": 54, \"attribution\": 55, \"ongoing\": 148, \"established\": 16, \"cert\": 10, \"raidforums\": 2, \"carzita\": 2, \"launching\": 23, \"undisclosed\": 4, \"conhostsexe\": 3, \"bceefecaeefbffadbcbeadbfd\": 5, \"uploaded\": 55, \"public\": 152, \"repository\": 39, \"kyiv\": 3, \"executable\": 154, \"signed\": 66, \"valid\": 66, \"hermetica\": 4, \"digital\": 76, \"ltd\": 14, \"signing\": 18, \"certificate\": 157, \"explicitly\": 4, \"revoked\": 6, \"issuer\": 2, \"upon\": 95, \"execution\": 312, \"enumerates\": 6, \"wipe\": 6, \"partition\": 14, \"info\": 18, \"reboot\": 12, \"predictably\": 2, \"following\": 618, \"screen\": 63, \"analysis\": 477, \"confirmed\": 25, \"accepts\": 9, \"commandline\": 22, \"argument\": 40, \"allowing\": 34, \"instruct\": 14, \"sleep\": 28, \"period\": 24, \"shut\": 20, \"kernel\": 82, \"module\": 200, \"responsible\": 36, \"actual\": 52, \"wiping\": 4, \"easeus\": 2, \"master\": 16, \"free\": 48, \"reorganize\": 2, \"disk\": 28, \"space\": 38, \"contractor\": 13, \"latvia\": 2, \"lithuania\": 6, \"eset\": 6, \"warned\": 4, \"installed\": 108, \"machine\": 229, \"concurrent\": 2, \"discovery\": 132, \"witnessed\": 16, \"appear\": 104, \"copied\": 27, \"messaging\": 39, \"template\": 37, \"exploiting\": 100, \"octobercms\": 27, \"jan\": 25, \"adding\": 23, \"onion\": 6, \"red\": 32, \"font\": 4, \"translates\": 8, \"proof\": 30, \"entity\": 27, \"calling\": 24, \"civilian\": 2, \"offering\": 28, \"sell\": 26, \"containing\": 134, \"citizen\": 12, \"leak\": 73, \"section\": 105, \"expanded\": 16, \"govua\": 4, \"domain\": 634, \"ukranian\": 2, \"company\": 221, \"motorsichcom\": 2, \"airplane\": 2, \"helicopter\": 2, \"team\": 276, \"larger\": 32, \"regarding\": 25, \"ukrainerelated\": 18, \"url\": 322, \"advanced\": 183, \"filtering\": 24, \"noticed\": 58, \"tlds\": 2, \"comua\": 2, \"popular\": 61, \"keywords\": 7, \"correlate\": 17, \"google\": 640, \"search\": 60, \"aid\": 10, \"february\": 54, \"appears\": 93, \"followed\": 41, \"similar\": 234, \"internet\": 263, \"midlate\": 2, \"situation\": 39, \"remains\": 32, \"phishingscam\": 2, \"currently\": 73, \"continuing\": 30, \"trending\": 4, \"ingesting\": 2, \"thirdparty\": 43, \"feed\": 10, \"inhouse\": 15, \"learning\": 41, \"webpage\": 25, \"administration\": 39, \"employee\": 48, \"imitating\": 2, \"visiting\": 30, \"username\": 32, \"field\": 29, \"pre\": 2, \"populated\": 2, \"prompted\": 18, \"password\": 189, \"order\": 97, \"sensitive\": 36, \"shown\": 155, \"hxxpsstartrackzmcomwapadminonedriveonednoautophpemailredactedredactedgovua\": 2, \"surrounding\": 31, \"sharing\": 75, \"authority\": 13, \"internationally\": 3, \"subscribe\": 4, \"protected\": 76, \"monitored\": 5, \"eg\": 47, \"refugee\": 3, \"newly\": 47, \"registered\": 36, \"nrds\": 2, \"particular\": 103, \"sharp\": 2, \"manually\": 32, \"sample\": 654, \"set\": 254, \"interesting\": 94, \"study\": 20, \"detailed\": 83, \"revealed\": 49, \"wallet\": 47, \"btc\": 30, \"eth\": 2, \"accept\": 17, \"easy\": 36, \"require\": 38, \"verification\": 24, \"mimicking\": 18, \"trick\": 52, \"instance\": 166, \"donatetoukrainecom\": 2, \"pretending\": 4, \"alive\": 6, \"shared\": 84, \"match\": 28, \"saverussiatoday\": 5, \"open\": 177, \"start\": 97, \"making\": 80, \"request\": 249, \"page\": 361, \"strongly\": 12, \"possibility\": 10, \"misleading\": 8, \"described\": 90, \"donating\": 2, \"whether\": 64, \"referenced\": 16, \"official\": 49, \"charity\": 4, \"squatting\": 2, \"communication\": 166, \"deceive\": 4, \"distributing\": 22, \"masquerading\": 10, \"global\": 73, \"app\": 441, \"nextgeneration\": 24, \"firewall\": 71, \"via\": 402, \"dns\": 73, \"wildfire\": 71, \"subscription\": 26, \"rotate\": 2, \"distribute\": 34, \"impersonating\": 28, \"widely\": 36, \"video\": 95, \"conferencing\": 2, \"monitor\": 55, \"lead\": 133, \"companywide\": 2, \"collect\": 66, \"evaluate\": 6, \"disseminate\": 4, \"collaborating\": 10, \"partner\": 32, \"finding\": 146, \"telemetry\": 22, \"neardaily\": 2, \"best\": 95, \"includes\": 133, \"blocking\": 44, \"name\": 401, \"xdr\": 106, \"pro\": 19, \"block\": 114, \"api\": 87, \"coverage\": 23, \"whispergate\": 25, \"xsoar\": 30, \"playbook\": 11, \"hunt\": 23, \"assist\": 10, \"managing\": 12, \"surface\": 40, \"contains\": 151, \"structured\": 2, \"mapping\": 18, \"aligned\": 12, \"mitre\": 67, \"attck\": 77, \"framework\": 141, \"blog\": 236, \"family\": 253, \"expect\": 28, \"proposed\": 4, \"appropriate\": 22, \"given\": 92, \"variety\": 26, \"prioritize\": 18, \"four\": 80, \"know\": 90, \"certain\": 70, \"shape\": 6, \"taking\": 58, \"step\": 132, \"arm\": 8, \"ass\": 54, \"test\": 46, \"proactive\": 30, \"incident\": 112, \"simulation\": 8, \"likelihood\": 4, \"destructive\": 20, \"pose\": 40, \"beneficial\": 4, \"preparing\": 4, \"ensuring\": 10, \"recovery\": 25, \"plan\": 32, \"place\": 82, \"distilled\": 4, \"gained\": 12, \"responding\": 4, \"readiness\": 2, \"strengthen\": 4, \"process\": 446, \"mitigate\": 50, \"coming\": 28, \"think\": 93, \"urgent\": 20, \"touch\": 22, \"response\": 170, \"north\": 46, \"america\": 18, \"tollfree\": 6, \"emea\": 12, \"apac\": 8, \"japan\": 32, \"conflict\": 16, \"aka\": 30, \"primitive\": 2, \"payload\": 405, \"include\": 120, \"stealer\": 112, \"outsteel\": 3, \"downloader\": 115, \"saintbot\": 3, \"briefing\": 5, \"cisa\": 30, \"shield\": 14, \"guidance\": 26, \"eeabeabadeacbecdefeceda\": 2, \"acefadbbfbacaedbeeecececebfde\": 2, \"cafbfbbacbfeaebddb\": 2, \"cbecbbcddfbdbceffeecfadfbf\": 2, \"cdadccfeabeeaefdededfdac\": 2, \"thumbprint\": 4, \"aedfacddefbebeaadd\": 2, \"serial\": 14, \"c\": 323, \"ac\": 4, \"ce\": 2, \"ba\": 2, \"f\": 62, \"e\": 4, \"ec\": 2, \"gcbejmrcjftouqbxuhimjoroouqcuxbmyraxqaefkzbdidonion\": 2, \"github\": 76, \"aaa\": 4, \"department\": 14, \"homeland\": 6, \"agency\": 67, \"dhscisa\": 2, \"identifies\": 23, \"selection\": 2, \"persistent\": 63, \"assessed\": 10, \"recommends\": 20, \"broader\": 4, \"kevs\": 6, \"cited\": 2, \"identified\": 191, \"xpanses\": 2, \"entire\": 52, \"discover\": 22, \"remediate\": 6, \"exposure\": 20, \"listed\": 56, \"routinely\": 20, \"despite\": 26, \"cf\": 10, \"old\": 44, \"beyond\": 30, \"overarching\": 2, \"reduction\": 4, \"forwardfacing\": 2, \"prioritized\": 10, \"patching\": 36, \"binding\": 14, \"operational\": 20, \"directive\": 12, \"bod\": 2, \"reducing\": 10, \"kev\": 4, \"requires\": 50, \"catalog\": 2, \"carry\": 36, \"federal\": 24, \"workflow\": 2, \"secops\": 6, \"cisaidentified\": 2, \"april\": 92, \"pt\": 26, \"remote\": 324, \"tuesday\": 11, \"trusteer\": 3, \"citadel\": 7, \"relied\": 17, \"vnc\": 9, \"give\": 58, \"began\": 33, \"infects\": 7, \"standard\": 69, \"desktop\": 40, \"rdp\": 33, \"allows\": 117, \"maintain\": 16, \"removed\": 48, \"indicates\": 34, \"fly\": 4, \"radar\": 12, \"commonly\": 33, \"often\": 94, \"treated\": 4, \"later\": 83, \"uscert\": 2, \"taa\": 2, \"backoff\": 4, \"sale\": 10, \"po\": 2, \"describes\": 9, \"unsafe\": 30, \"reconnaissance\": 44, \"brute\": 46, \"toward\": 8, \"unauthorized\": 56, \"implant\": 37, \"installation\": 53, \"subsequent\": 34, \"exfiltration\": 84, \"consumer\": 22, \"intent\": 12, \"inefficient\": 2, \"travel\": 4, \"physical\": 24, \"office\": 146, \"track\": 88, \"remoteaccess\": 4, \"applipedia\": 2, \"protocol\": 135, \"virtual\": 78, \"connection\": 146, \"teamviewer\": 8, \"shell\": 178, \"ssh\": 28, \"traffic\": 112, \"separate\": 49, \"bad\": 72, \"run\": 273, \"relies\": 13, \"desk\": 2, \"rest\": 24, \"putting\": 14, \"enforcing\": 4, \"uncontrolled\": 2, \"broadens\": 2, \"act\": 38, \"backdoor\": 514, \"highlighting\": 20, \"importance\": 14, \"controlling\": 4, \"issue\": 117, \"cryptowall\": 64, \"version\": 680, \"tor\": 39, \"command\": 733, \"fsecure\": 2, \"spot\": 21, \"october\": 53, \"ramped\": 2, \"emerging\": 14, \"daily\": 12, \"picked\": 12, \"september\": 36, \"delivered\": 122, \"primarily\": 56, \"pdfs\": 16, \"plagued\": 4, \"nearly\": 43, \"rsa\": 31, \"encryption\": 129, \"necessary\": 27, \"unless\": 19, \"agrees\": 5, \"communicates\": 20, \"anonymization\": 5, \"hide\": 50, \"avoid\": 81, \"explicit\": 4, \"allow\": 83, \"altogether\": 8, \"youll\": 4, \"popup\": 16, \"option\": 28, \"green\": 4, \"resolve\": 15, \"whois\": 13, \"record\": 67, \"ladomfichisimailru\": 3, \"register\": 49, \"confiscated\": 3, \"otherwise\": 37, \"instructs\": 11, \"paytordmbdekmizqonion\": 3, \"accessible\": 29, \"unlikely\": 21, \"flexible\": 7, \"competition\": 3, \"acquire\": 6, \"bitcoins\": 2, \"history\": 44, \"retrieve\": 49, \"uptodate\": 14, \"alltogether\": 2, \"attempting\": 36, \"deliver\": 85, \"sometimes\": 61, \"contained\": 69, \"invoice\": 12, \"fax\": 4, \"voicemail\": 4, \"theme\": 30, \"evolve\": 22, \"contain\": 79, \"kafeine\": 3, \"discussing\": 7, \"inclusion\": 5, \"cve\": 569, \"nuclear\": 3, \"pack\": 12, \"installing\": 40, \"yesterday\": 4, \"carried\": 32, \"pdf\": 60, \"inside\": 110, \"failure\": 6, \"except\": 14, \"fee\": 6, \"adobe\": 47, \"reader\": 15, \"embedded\": 142, \"bmp\": 9, \"parsing\": 13, \"integer\": 7, \"overflow\": 23, \"trustedsec\": 5, \"consultancy\": 2, \"ohio\": 5, \"breach\": 54, \"community\": 77, \"health\": 32, \"chs\": 2, \"exploitation\": 198, \"heartbleed\": 25, \"openssl\": 12, \"chss\": 2, \"k\": 59, \"filing\": 4, \"monday\": 6, \"reveal\": 20, \"approximately\": 18, \"patient\": 4, \"june\": 109, \"apparently\": 5, \"glean\": 3, \"log\": 96, \"vpn\": 41, \"announced\": 30, \"disclosure\": 20, \"reminds\": 2, \"scrape\": 6, \"memory\": 131, \"secret\": 40, \"included\": 107, \"laterally\": 14, \"discovering\": 14, \"ago\": 10, \"library\": 120, \"networkbased\": 4, \"substitute\": 4, \"detectable\": 2, \"patched\": 100, \"deploy\": 59, \"attempted\": 34, \"youve\": 12, \"sending\": 60, \"probe\": 6, \"evidence\": 59, \"jiggling\": 2, \"handle\": 46, \"front\": 8, \"door\": 4, \"volexity\": 13, \"memorial\": 2, \"weekend\": 6, \"suspicious\": 56, \"internetfacing\": 12, \"atlassians\": 4, \"confluence\": 37, \"determined\": 19, \"foothold\": 31, \"code\": 907, \"center\": 44, \"atlassian\": 22, \"assigned\": 24, \"advisory\": 51, \"indeed\": 22, \"unauthenticated\": 11, \"bypass\": 71, \"arbitrary\": 41, \"publication\": 26, \"management\": 59, \"potentially\": 49, \"resolving\": 7, \"advises\": 2, \"immediately\": 42, \"inthewild\": 31, \"observation\": 26, \"managed\": 40, \"hunting\": 38, \"conclusion\": 67, \"endoflife\": 11, \"exposed\": 20, \"isolated\": 28, \"decommissioned\": 2, \"ubiquitous\": 6, \"refer\": 20, \"thus\": 28, \"far\": 57, \"noted\": 73, \"historical\": 16, \"scan\": 74, \"performed\": 50, \"date\": 50, \"purported\": 14, \"concept\": 31, \"poc\": 31, \"reached\": 10, \"attempt\": 246, \"resulted\": 14, \"cerber\": 4, \"blocked\": 68, \"agent\": 34, \"xql\": 8, \"query\": 30, \"multiple\": 298, \"postexploitation\": 17, \"tomcatexe\": 2, \"spawned\": 8, \"whoami\": 10, \"systeminfo\": 6, \"arp\": 2, \"ipconfig\": 4, \"etc\": 20, \"baseencoded\": 8, \"powershell\": 171, \"retrieved\": 18, \"confirm\": 26, \"assumption\": 4, \"looked\": 12, \"apache\": 52, \"atlassianconfluencelog\": 2, \"provides\": 132, \"connected\": 61, \"classify\": 8, \"upgraded\": 6, \"insecure\": 6, \"existing\": 39, \"expander\": 2, \"enumerated\": 2, \"tab\": 16, \"emerges\": 2, \"accordingly\": 12, \"encountered\": 18, \"originated\": 4, \"shopper\": 26, \"retailer\": 42, \"gear\": 2, \"holiday\": 22, \"season\": 20, \"affect\": 76, \"halt\": 4, \"shopping\": 27, \"posting\": 16, \"showed\": 37, \"percent\": 8, \"driven\": 10, \"skyrocketing\": 2, \"slowing\": 4, \"anytime\": 2, \"remain\": 28, \"avenue\": 10, \"bracing\": 2, \"lapse\": 4, \"vigilance\": 4, \"simply\": 56, \"trust\": 48, \"wholly\": 4, \"preventable\": 4, \"minimal\": 10, \"lasting\": 8, \"effect\": 14, \"annoyance\": 2, \"worst\": 6, \"ease\": 10, \"suddenly\": 2, \"unexpectedly\": 2, \"slow\": 10, \"severe\": 23, \"dire\": 2, \"harm\": 44, \"computing\": 26, \"power\": 22, \"computationally\": 4, \"intensive\": 6, \"meaning\": 14, \"lot\": 28, \"concerned\": 10, \"behalf\": 4, \"others\": 94, \"either\": 103, \"someone\": 24, \"else\": 14, \"advertising\": 14, \"revenue\": 4, \"authorized\": 4, \"informs\": 2, \"expected\": 38, \"notification\": 44, \"becomes\": 20, \"essence\": 2, \"special\": 21, \"performs\": 51, \"theyre\": 44, \"happens\": 32, \"owner\": 47, \"permission\": 72, \"talking\": 12, \"clearly\": 20, \"attacking\": 16, \"youre\": 36, \"untrustworthy\": 6, \"manner\": 12, \"attacked\": 21, \"focusing\": 24, \"task\": 108, \"anyway\": 2, \"finally\": 36, \"chosen\": 16, \"implement\": 46, \"engaged\": 10, \"facing\": 2, \"easily\": 30, \"forewarned\": 4, \"forearmed\": 4, \"forearming\": 2, \"intro\": 2, \"innovation\": 15, \"generation\": 16, \"dga\": 24, \"automation\": 25, \"harder\": 36, \"counter\": 42, \"fortunately\": 12, \"dgas\": 8, \"fashion\": 6, \"developed\": 73, \"instruction\": 37, \"usually\": 56, \"referred\": 61, \"switch\": 12, \"static\": 21, \"predict\": 2, \"decode\": 20, \"built\": 56, \"thousand\": 54, \"limited\": 40, \"dgarelated\": 2, \"whack\": 2, \"mole\": 2, \"futile\": 2, \"enables\": 46, \"modern\": 40, \"try\": 79, \"evade\": 65, \"countermeasure\": 10, \"usefulness\": 2, \"component\": 162, \"conficker\": 4, \"fuel\": 2, \"dgafueled\": 4, \"antidga\": 2, \"leverage\": 65, \"capable\": 36, \"countering\": 6, \"automated\": 36, \"prediction\": 4, \"anticipate\": 2, \"takedown\": 8, \"deploying\": 23, \"meant\": 26, \"busy\": 10, \"realworld\": 22, \"life\": 38, \"together\": 48, \"friend\": 18, \"coworkers\": 8, \"safer\": 22, \"want\": 65, \"write\": 43, \"ucommspaloaltonetworkscom\": 8, \"android\": 447, \"older\": 34, \"oreo\": 4, \"leaf\": 6, \"falling\": 4, \"toast\": 22, \"overlay\": 50, \"fix\": 36, \"display\": 50, \"pop\": 10, \"employ\": 43, \"interact\": 2, \"performing\": 31, \"function\": 317, \"engaging\": 4, \"desired\": 6, \"bogus\": 6, \"installer\": 110, \"overlying\": 4, \"requesting\": 8, \"administrative\": 20, \"interaction\": 18, \"install\": 134, \"grant\": 12, \"lock\": 14, \"render\": 6, \"dependent\": 6, \"condition\": 32, \"longer\": 43, \"required\": 28, \"play\": 139, \"general\": 56, \"outdated\": 16, \"store\": 176, \"follow\": 36, \"supplement\": 2, \"discus\": 28, \"propagation\": 13, \"extortion\": 49, \"hope\": 34, \"direction\": 2, \"quarter\": 14, \"q\": 78, \"statistical\": 6, \"cover\": 24, \"demonstrates\": 32, \"diversity\": 14, \"emphasizes\": 2, \"expand\": 26, \"profiling\": 4, \"proportion\": 2, \"virlock\": 19, \"largest\": 15, \"fileinfectorlike\": 2, \"behavior\": 85, \"necessarily\": 12, \"imply\": 8, \"prevalence\": 4, \"ratio\": 6, \"huge\": 8, \"completely\": 22, \"stem\": 8, \"counting\": 6, \"lens\": 2, \"ryuk\": 18, \"sodinokibi\": 11, \"maze\": 8, \"efficient\": 6, \"propagate\": 8, \"arrives\": 4, \"entry\": 61, \"delivering\": 36, \"forum\": 47, \"chat\": 105, \"offered\": 26, \"freeware\": 2, \"hosting\": 68, \"successfully\": 70, \"multilayered\": 14, \"chain\": 213, \"alumnilocker\": 2, \"archive\": 73, \"lnk\": 27, \"obfuscated\": 76, \"script\": 611, \"break\": 26, \"bit\": 73, \"exe\": 25, \"downloaders\": 20, \"compressed\": 8, \"archived\": 2, \"resume\": 6, \"portfolio\": 2, \"icon\": 42, \"makop\": 8, \"z\": 7, \"infostealer\": 7, \"dedfaecefdfcedabfddfbcadedda\": 3, \"gandcrab\": 6, \"jscript\": 4, \"leveraging\": 34, \"background\": 56, \"intelligent\": 4, \"mailto\": 5, \"netwalker\": 3, \"tends\": 5, \"highly\": 47, \"seldom\": 4, \"rtf\": 54, \"led\": 49, \"remotely\": 39, \"besides\": 10, \"encrypting\": 20, \"claim\": 16, \"installs\": 54, \"explain\": 10, \"mention\": 11, \"reaching\": 8, \"darknet\": 4, \"contact\": 50, \"asks\": 10, \"xmr\": 2, \"wanacryptr\": 51, \"babuk\": 22, \"reach\": 40, \"input\": 12, \"identification\": 12, \"decryption\": 75, \"dharma\": 2, \"dearcry\": 4, \"untraceable\": 4, \"complicated\": 8, \"create\": 102, \"automatically\": 39, \"received\": 160, \"involved\": 55, \"aggregate\": 2, \"xorist\": 3, \"abceccfcafadecedfecced\": 3, \"demanded\": 8, \"bfqrlcdwwrxueyffdndqeoaspjignxt\": 3, \"really\": 38, \"mixing\": 2, \"tumbling\": 2, \"pretty\": 10, \"withdraw\": 2, \"disperse\": 2, \"ndyjtntjmwkxpnhjgamuhdhigtobus\": 2, \"cedefcaacadefedfceab\": 2, \"owned\": 17, \"binance\": 4, \"ref\": 2, \"twitter\": 44, \"worth\": 19, \"doe\": 150, \"multimillion\": 2, \"garner\": 2, \"spread\": 85, \"extension\": 73, \"modification\": 28, \"registry\": 121, \"hkcusoftwaremicrosoftwindowscurrentversionexploreradvancedhidefileext\": 3, \"hkcusoftwaremicrosoftwindowscurrentversionexploreradvancedhidden\": 3, \"usual\": 23, \"opening\": 32, \"doc\": 44, \"ppt\": 10, \"jpg\": 28, \"bmpgif\": 2, \"rar\": 18, \"screenshot\": 87, \"captured\": 25, \"suggesting\": 24, \"written\": 100, \"equaled\": 4, \"experiment\": 6, \"spreading\": 10, \"contribute\": 4, \"collected\": 86, \"ryk\": 4, \"ryukreadmehtml\": 4, \"local\": 102, \"smb\": 25, \"send\": 176, \"wakeonlan\": 2, \"packet\": 126, \"wake\": 6, \"configured\": 32, \"lastly\": 12, \"gave\": 17, \"employing\": 15, \"disaster\": 6, \"instantly\": 2, \"coordinate\": 10, \"aipowered\": 2, \"inline\": 2, \"preemptively\": 8, \"unitinvestigationspaloaltonetworkscom\": 4, \"companion\": 2, \"hancitor\": 53, \"deftly\": 2, \"applying\": 12, \"fundamental\": 6, \"principle\": 12, \"timing\": 8, \"specialization\": 4, \"globalization\": 4, \"onto\": 27, \"busiest\": 4, \"middle\": 39, \"adapting\": 10, \"theyve\": 20, \"globe\": 18, \"ideal\": 12, \"xp\": 14, \"jumped\": 2, \"pattern\": 54, \"spike\": 8, \"occurrence\": 4, \"timeline\": 34, \"especially\": 51, \"combined\": 32, \"final\": 81, \"gotten\": 2, \"adapt\": 8, \"something\": 42, \"delivery\": 67, \"amazon\": 20, \"shipping\": 4, \"notice\": 42, \"malspam\": 2, \"rather\": 78, \"globalizing\": 4, \"map\": 14, \"webistes\": 2, \"globally\": 24, \"table\": 189, \"hot\": 3, \"represents\": 13, \"created\": 167, \"provider\": 122, \"hotspot\": 3, \"asia\": 37, \"represent\": 15, \"decision\": 18, \"optimize\": 4, \"reflect\": 2, \"awareness\": 56, \"reality\": 26, \"peak\": 4, \"dividing\": 2, \"mirror\": 4, \"mainstream\": 2, \"stay\": 40, \"seem\": 22, \"succeeding\": 9, \"foreseeable\": 4, \"petya\": 32, \"lesser\": 3, \"extent\": 15, \"th\": 16, \"lateral\": 73, \"movement\": 83, \"eternalblue\": 22, \"wanacryptrwannacry\": 11, \"documenting\": 4, \"capability\": 211, \"regard\": 18, \"autofocus\": 11, \"modifying\": 17, \"boot\": 16, \"mbr\": 8, \"causing\": 12, \"reboots\": 8, \"modified\": 108, \"prevents\": 20, \"loading\": 59, \"chkdisk\": 6, \"repaired\": 2, \"completes\": 4, \"ascii\": 10, \"demanding\": 2, \"displayed\": 68, \"reportedly\": 19, \"originally\": 24, \"shadow\": 19, \"broker\": 32, \"wowsmithposteonet\": 2, \"posteo\": 2, \"utc\": 16, \"thth\": 2, \"transferred\": 9, \"unaware\": 4, \"technically\": 12, \"infeasible\": 2, \"impossible\": 6, \"occur\": 26, \"functionally\": 6, \"purpose\": 84, \"considered\": 14, \"lifecycle\": 18, \"deliveryexploitation\": 4, \"source\": 231, \"medoc\": 3, \"dll\": 181, \"heavily\": 35, \"morning\": 4, \"jun\": 4, \"must\": 76, \"overwrites\": 10, \"creates\": 65, \"scheduled\": 80, \"believing\": 6, \"repairing\": 2, \"ntfs\": 2, \"rarely\": 6, \"coupled\": 4, \"worm\": 18, \"wannacry\": 6, \"demonstrated\": 12, \"discussion\": 16, \"live\": 59, \"summary\": 30, \"pm\": 52, \"ereceipts\": 2, \"lease\": 2, \"apartment\": 2, \"useful\": 24, \"untrusted\": 8, \"adversary\": 24, \"choose\": 10, \"subverted\": 4, \"abused\": 68, \"straightforward\": 9, \"weaponize\": 2, \"builtin\": 26, \"vba\": 22, \"visual\": 47, \"execute\": 209, \"assuming\": 8, \"previously\": 207, \"asking\": 6, \"docm\": 4, \"docx\": 30, \"content\": 226, \"wide\": 24, \"emotet\": 6, \"sofacy\": 29, \"convince\": 10, \"convincing\": 4, \"color\": 4, \"white\": 12, \"present\": 40, \"visible\": 10, \"flash\": 108, \"external\": 25, \"object\": 153, \"passed\": 18, \"handling\": 16, \"embedding\": 13, \"player\": 48, \"swf\": 3, \"excel\": 47, \"trigger\": 36, \"shellcode\": 124, \"equation\": 30, \"editor\": 19, \"embed\": 21, \"parsed\": 8, \"mathematical\": 2, \"paving\": 2, \"flaw\": 24, \"eqnedtexe\": 4, \"emet\": 2, \"guard\": 6, \"default\": 65, \"winwordexe\": 6, \"ole\": 8, \"hta\": 22, \"handler\": 28, \"officewordpad\": 2, \"rce\": 75, \"oilrig\": 6, \"exactly\": 8, \"word\": 78, \"texthtml\": 2, \"mimetype\": 2, \"mshtml\": 4, \"expose\": 16, \"explorer\": 102, \"logical\": 4, \"htmljavascriptvbscript\": 2, \"sandboxed\": 4, \"filesystem\": 2, \"corruption\": 4, \"uaf\": 2, \"vbscript\": 12, \"documentbased\": 2, \"popularity\": 6, \"complexity\": 6, \"developer\": 211, \"trap\": 8, \"fun\": 28, \"everybody\": 6, \"kaminsky\": 2, \"scrambling\": 8, \"immediate\": 10, \"yes\": 42, \"said\": 53, \"answered\": 2, \"motherinlaw\": 4, \"melting\": 2, \"shes\": 2, \"reading\": 12, \"press\": 6, \"ill\": 2, \"scott\": 2, \"simkin\": 2, \"essay\": 2, \"dan\": 2, \"goodin\": 2, \"ar\": 2, \"technica\": 2, \"explanation\": 4, \"eight\": 21, \"consideration\": 6, \"perfect\": 8, \"secrecy\": 2, \"ensures\": 8, \"session\": 109, \"derived\": 15, \"aug\": 8, \"injection\": 77, \"release\": 67, \"mass\": 14, \"scanning\": 55, \"begun\": 14, \"tl\": 6, \"newest\": 10, \"mitigation\": 47, \"hosted\": 157, \"writeupsconfluencercemd\": 2, \"httpvoidwriteups\": 2, \"sept\": 11, \"microsofts\": 22, \"msrc\": 6, \"detailing\": 14, \"affecting\": 28, \"azure\": 19, \"package\": 65, \"omi\": 24, \"opensource\": 66, \"portable\": 12, \"backbone\": 2, \"webbased\": 4, \"diagnostic\": 15, \"analytic\": 6, \"unix\": 16, \"linux\": 80, \"manage\": 31, \"vms\": 2, \"container\": 14, \"serverless\": 4, \"according\": 70, \"wiz\": 4, \"escalation\": 48, \"dubbed\": 38, \"omigod\": 5, \"prisma\": 18, \"custom\": 103, \"rule\": 38, \"navigate\": 16, \"nametypepackageminversioninclusivemaxversioninclusivemd\": 2, \"omigodpackageomi\": 2, \"azurebased\": 4, \"vm\": 4, \"cnseries\": 4, \"taken\": 67, \"cn\": 2, \"useafterfree\": 32, \"bug\": 54, \"ie\": 69, \"deal\": 25, \"introduced\": 24, \"heap\": 34, \"solve\": 6, \"july\": 83, \"deferred\": 14, \"freeing\": 12, \"allocates\": 2, \"dedicated\": 27, \"select\": 22, \"occupied\": 2, \"usercontrolled\": 6, \"freed\": 28, \"precise\": 2, \"ghisolatedheap\": 2, \"applied\": 14, \"internal\": 62, \"protectedfree\": 4, \"encapsulate\": 2, \"apply\": 46, \"mshtmldll\": 4, \"memoryprotectionheapfree\": 4, \"idea\": 22, \"delay\": 12, \"intruder\": 2, \"unable\": 18, \"determine\": 57, \"occupy\": 4, \"controlled\": 50, \"filled\": 8, \"x\": 260, \"pool\": 16, \"size\": 50, \"hit\": 50, \"predefined\": 20, \"threshold\": 8, \"xa\": 10, \"highlighted\": 19, \"reclaimunmarkedblocks\": 2, \"style\": 30, \"pseudo\": 2, \"tobefreed\": 2, \"structure\": 81, \"stprotecfreemanageheap\": 8, \"memoryprotectioncmemoryprotectorprotectcurrentthread\": 2, \"alternate\": 2, \"cmemoryprotectorprotectedfree\": 6, \"javascript\": 87, \"anchor\": 6, \"element\": 25, \"debug\": 18, \"xcbf\": 2, \"fill\": 6, \"forcing\": 4, \"totalmemorysize\": 2, \"debugging\": 4, \"turned\": 34, \"whole\": 26, \"invalid\": 22, \"exception\": 21, \"extremely\": 28, \"helpful\": 4, \"trying\": 18, \"introduction\": 8, \"truly\": 8, \"exists\": 43, \"thrown\": 2, \"memoryprotectioncmemoryprotectorunprotectprocess\": 2, \"perform\": 34, \"fuzzing\": 2, \"strong\": 46, \"preventative\": 2, \"passively\": 2, \"confusion\": 7, \"introduce\": 2, \"defensive\": 4, \"fengshui\": 2, \"cat\": 8, \"mouse\": 4, \"tell\": 17, \"releasing\": 13, \"paper\": 45, \"titled\": 16, \"credentialbased\": 4, \"exposing\": 11, \"ecosystem\": 36, \"motif\": 8, \"theft\": 95, \"exploring\": 2, \"synonymous\": 2, \"increasingly\": 14, \"stealing\": 43, \"erase\": 2, \"reconfigure\": 2, \"undertake\": 2, \"underpin\": 3, \"damaging\": 12, \"shamoon\": 62, \"notable\": 84, \"keyloggers\": 5, \"staple\": 5, \"reuse\": 21, \"authorization\": 6, \"weaker\": 2, \"move\": 44, \"blend\": 10, \"penetrate\": 4, \"elevate\": 10, \"overlooked\": 6, \"education\": 24, \"manager\": 46, \"complex\": 12, \"catching\": 2, \"advance\": 2, \"twofactormultifactor\": 2, \"famfa\": 2, \"onetime\": 6, \"otp\": 2, \"panos\": 8, \"limit\": 18, \"eliminate\": 18, \"copy\": 80, \"ignite\": 18, \"conference\": 34, \"vancouver\": 6, \"bc\": 8, \"fourday\": 6, \"hear\": 6, \"innovator\": 6, \"skill\": 16, \"handson\": 6, \"interactive\": 6, \"workshop\": 12, \"marquee\": 6, \"curveball\": 2, \"cryptoapi\": 4, \"cryptdll\": 2, \"relates\": 4, \"elliptic\": 6, \"curve\": 10, \"cryptography\": 4, \"ecc\": 4, \"validation\": 4, \"affirmed\": 4, \"itw\": 4, \"tal\": 2, \"beery\": 2, \"win\": 8, \"cheating\": 4, \"billiard\": 2, \"fantastic\": 2, \"job\": 52, \"explaining\": 6, \"provided\": 97, \"typical\": 45, \"programming\": 18, \"interface\": 28, \"cveeventwrite\": 2, \"publish\": 33, \"usermode\": 6, \"analyst\": 30, \"chrome\": 157, \"safeguarded\": 2, \"spoofing\": 41, \"regardless\": 20, \"complementary\": 4, \"member\": 71, \"mapp\": 4, \"providing\": 44, \"chainoffoolscurveball\": 2, \"explained\": 6, \"billiards\": 2, \"nsa\": 2, \"petyanotpetya\": 19, \"delved\": 2, \"nut\": 2, \"bolt\": 2, \"apc\": 29, \"toolkit\": 18, \"stealth\": 14, \"maximizing\": 2, \"proven\": 16, \"adopted\": 15, \"dangerous\": 24, \"unixlinux\": 2, \"operates\": 6, \"highest\": 26, \"generally\": 32, \"elevation\": 2, \"eop\": 2, \"conjunction\": 13, \"redirect\": 98, \"asynchronous\": 2, \"line\": 90, \"crux\": 2, \"illegitimate\": 6, \"easier\": 14, \"interfering\": 2, \"unintended\": 2, \"consequence\": 12, \"fingerprint\": 18, \"certainly\": 12, \"contributing\": 2, \"perhaps\": 6, \"escaped\": 2, \"relative\": 4, \"outside\": 39, \"escape\": 30, \"inviting\": 2, \"copycat\": 2, \"thread\": 24, \"mmpc\": 2, \"wannacrypt\": 2, \"outofdate\": 6, \"countercepts\": 2, \"doublepulsar\": 5, \"generic\": 18, \"reflective\": 6, \"loader\": 333, \"glamorized\": 2, \"caused\": 14, \"wealth\": 4, \"prominent\": 13, \"torrentlocker\": 4, \"teslacrypt\": 4, \"might\": 70, \"movie\": 6, \"photo\": 26, \"businessrelated\": 2, \"bulletproof\": 4, \"emnisoft\": 2, \"pclock\": 60, \"riddled\": 2, \"xor\": 60, \"routine\": 130, \"recover\": 30, \"august\": 67, \"improved\": 12, \"author\": 91, \"sake\": 4, \"clarity\": 2, \"newer\": 14, \"ida\": 2, \"idb\": 2, \"initially\": 38, \"antianalysis\": 4, \"random\": 34, \"compare\": 12, \"spent\": 6, \"sleeping\": 2, \"looking\": 77, \"sandbox\": 66, \"accelerates\": 4, \"hooking\": 45, \"completed\": 4, \"sends\": 55, \"http\": 265, \"p\": 34, \"statically\": 6, \"tid\": 2, \"rnd\": 2, \"variable\": 51, \"randomly\": 33, \"generated\": 77, \"runtime\": 34, \"characteristic\": 23, \"potid\": 2, \"useragent\": 20, \"proceeds\": 32, \"winjabexe\": 2, \"path\": 132, \"allusersprofile\": 2, \"appdata\": 4, \"persistence\": 94, \"setting\": 74, \"installok\": 2, \"clock\": 16, \"subpath\": 2, \"blockchaininfo\": 4, \"identifier\": 28, \"mrfkkerfbcadusosucbahngcqobkju\": 2, \"accomplishes\": 2, \"stored\": 62, \"bdatab\": 2, \"stated\": 15, \"concatenated\": 2, \"string\": 237, \"formation\": 2, \"hashed\": 4, \"cdatac\": 4, \"ignored\": 12, \"onebyone\": 2, \"forgone\": 2, \"rc\": 54, \"concatenating\": 2, \"ddaccfeceeacbcccdocuments\": 2, \"settingsadministratordesktopformcs\": 2, \"took\": 23, \"upwards\": 2, \"minute\": 16, \"comparison\": 41, \"roughly\": 4, \"directory\": 182, \"indicating\": 23, \"scanned\": 8, \"interest\": 43, \"finished\": 26, \"generates\": 14, \"delete\": 53, \"uac\": 18, \"createobjectshellapplication\": 2, \"uacshellexecute\": 2, \"vssadmin\": 2, \"quiet\": 4, \"runas\": 6, \"fairly\": 8, \"apparent\": 12, \"occurring\": 6, \"vbs\": 28, \"clean\": 14, \"zero\": 34, \"wallpaper\": 4, \"gui\": 2, \"instructing\": 2, \"dialogue\": 4, \"mimic\": 4, \"morecapable\": 2, \"english\": 20, \"spanish\": 6, \"wished\": 2, \"improvement\": 20, \"compete\": 2, \"truth\": 2, \"ignoring\": 2, \"plague\": 4, \"lack\": 29, \"equal\": 4, \"elegant\": 2, \"lacking\": 4, \"properly\": 14, \"classified\": 8, \"viewing\": 10, \"mobile\": 155, \"creator\": 6, \"displaying\": 16, \"advertisement\": 17, \"inapp\": 6, \"purchase\": 16, \"iaps\": 6, \"monetization\": 12, \"earning\": 4, \"danger\": 4, \"phone\": 94, \"smsbased\": 22, \"iap\": 54, \"chinese\": 70, \"taomike\": 33, \"sdk\": 8, \"capturing\": 8, \"party\": 64, \"china\": 93, \"intercept\": 12, \"frequently\": 25, \"location\": 79, \"tricking\": 7, \"charge\": 19, \"appeared\": 21, \"bill\": 2, \"antivirus\": 98, \"biggest\": 11, \"rich\": 6, \"hxxpcphp\": 2, \"uploads\": 28, \"belongs\": 12, \"uploading\": 25, \"zdtpay\": 2, \"taomikes\": 4, \"manifest\": 4, \"receiver\": 18, \"comzdtpayrfb\": 2, \"smsreceived\": 6, \"bootcompleted\": 4, \"priority\": 16, \"rfb\": 6, \"whenever\": 10, \"arrive\": 2, \"body\": 16, \"booted\": 2, \"mysde\": 4, \"saved\": 32, \"hashmap\": 2, \"apitaomikecom\": 2, \"hey\": 4, \"msg\": 6, \"circled\": 4, \"dashed\": 2, \"pcap\": 2, \"cphp\": 2, \"considerable\": 4, \"incorporate\": 8, \"purport\": 6, \"adult\": 25, \"kitkat\": 4, \"defined\": 16, \"trustworthy\": 2, \"carefully\": 12, \"abnormal\": 4, \"behave\": 4, \"poorly\": 2, \"safety\": 126, \"acknowledgement\": 2, \"appreciate\": 10, \"rongbo\": 2, \"shao\": 2, \"thank\": 34, \"ryan\": 6, \"olson\": 4, \"benjamin\": 2, \"richar\": 2, \"wartell\": 2, \"chris\": 4, \"clark\": 2, \"publishing\": 12, \"university\": 40, \"sold\": 29, \"taobao\": 22, \"consumertoconsumer\": 3, \"cc\": 560, \"ecommerce\": 35, \"advertised\": 14, \"registering\": 8, \"student\": 22, \"discount\": 12, \"coupon\": 8, \"obtaining\": 12, \"academic\": 14, \"implication\": 4, \"language\": 113, \"edu\": 10, \"mailbox\": 26, \"returned\": 16, \"expensive\": 4, \"rmb\": 8, \"usd\": 34, \"cheapest\": 2, \"toplevel\": 2, \"description\": 58, \"item\": 12, \"buyer\": 14, \"bought\": 4, \"unlock\": 6, \"incurring\": 2, \"review\": 50, \"favorable\": 2, \"comment\": 24, \"seller\": 32, \"candidacy\": 2, \"towards\": 12, \"registration\": 19, \"bestbuy\": 2, \"apple\": 34, \"dell\": 4, \"annual\": 6, \"enjoy\": 4, \"renew\": 2, \"mit\": 4, \"stanford\": 2, \"mainly\": 24, \"respective\": 18, \"print\": 17, \"electronic\": 8, \"booksjournals\": 2, \"advertises\": 6, \"talked\": 4, \"aliwangwang\": 6, \"instant\": 10, \"trading\": 2, \"wellstocked\": 2, \"told\": 2, \"belonged\": 2, \"recommended\": 8, \"identity\": 38, \"corresponding\": 20, \"customization\": 2, \"customizable\": 6, \"domaininstitution\": 2, \"xxxedu\": 2, \"subdomain\": 8, \"academia\": 14, \"requested\": 10, \"purchased\": 16, \"customized\": 55, \"confirmation\": 8, \"claudstudentcnriedu\": 2, \"navigating\": 6, \"cnris\": 2, \"webmail\": 58, \"noteworthy\": 14, \"usernames\": 12, \"californiacollegesedu\": 2, \"california\": 6, \"college\": 4, \"membership\": 4, \"presenting\": 2, \"anything\": 20, \"alipay\": 2, \"paypal\": 2, \"linked\": 275, \"associate\": 7, \"concern\": 28, \"usable\": 4, \"selling\": 37, \"addressing\": 6, \"remainder\": 2, \"requiring\": 16, \"staff\": 6, \"assume\": 8, \"nefarious\": 2, \"engineeringphishing\": 2, \"highvalue\": 20, \"personnel\": 14, \"implemented\": 40, \"twofactor\": 8, \"latter\": 12, \"residual\": 2, \"suggestion\": 4, \"mitigating\": 18, \"announcing\": 2, \"severity\": 10, \"bulletin\": 102, \"worstcase\": 4, \"scenario\": 51, \"brick\": 4, \"simplest\": 2, \"porn\": 6, \"droid\": 2, \"unwittingly\": 2, \"denialofservice\": 4, \"raising\": 16, \"away\": 16, \"precisely\": 12, \"accomplish\": 12, \"ieee\": 2, \"everyone\": 10, \"believed\": 23, \"overcome\": 4, \"hurdle\": 2, \"reckoned\": 2, \"worldwide\": 22, \"functional\": 2, \"equivalent\": 12, \"light\": 16, \"significance\": 4, \"immune\": 2, \"availability\": 30, \"carrier\": 6, \"handset\": 2, \"maker\": 8, \"aggressively\": 4, \"mutex\": 107, \"fingerprinting\": 18, \"classification\": 12, \"hypothesized\": 6, \"variability\": 2, \"seemingly\": 16, \"appearance\": 10, \"practical\": 8, \"embarrassingly\": 2, \"gvwnqjz\": 4, \"sourced\": 16, \"analytics\": 24, \"insight\": 40, \"quick\": 14, \"mutexes\": 34, \"bunch\": 6, \"meeting\": 6, \"talk\": 25, \"baton\": 2, \"person\": 10, \"speak\": 4, \"say\": 30, \"cookie\": 84, \"naively\": 2, \"updating\": 22, \"edits\": 4, \"writes\": 32, \"integrity\": 20, \"accessing\": 12, \"tweak\": 2, \"fear\": 2, \"clobbering\": 2, \"indication\": 18, \"referencing\": 8, \"probability\": 2, \"somewhere\": 10, 